CSI API ETABS v1
cOptions.GetDefaultFunctionFolder Method
 Returns the default folder to (recursively) search if a function data file is not found in the specified path or in the model folder. This is a global setting for the user and applies to all models.
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int GetDefaultFunctionFolder(
	ref string Path
)
Function GetDefaultFunctionFolder (
	ByRef Path As String
) As Integer
Dim instance As cOptions
Dim Path As String
Dim returnValue As Integer
returnValue = instance.GetDefaultFunctionFolder(Path)
int GetDefaultFunctionFolder(
	String^% Path
)
abstract GetDefaultFunctionFolder :
        Path : string byref -> int
Parameters
Path
Type: System.String
Returned full path to the default function folder.
Return Value
Type: Int32
 Returns zero if the data is successfully retrieved; otherwise it returns a nonzero value.
Remarks
Examples
Public Sub Example()
    Dim SapModel As cSapModel
    Dim EtabsObject As cOAPI
    Dim ret As Integer = -1
    'create ETABS object
    Dim myHelper As cHelper = New Helper
    EtabsObject = myHelper.CreateObjectProgID("CSI.ETABS.API.ETABSObject")
    'start ETABS application
    ret = EtabsObject.ApplicationStart()
    'create SapModel object
    SapModel = EtabsObject.SapModel
    'initialize model
    ret = SapModel.InitializeNewModel()
    'create a blank model from template
    ret = SapModel.File.NewBlank()
    'get default function folder
    Dim path As String = Nothing
    ret = SapModel.Options.GetDefaultFunctionFolder(path)
    'close ETABS
    EtabsObject.ApplicationExit(False)
    'clean up variables
    SapModel = Nothing
    EtabsObject = Nothing
End Sub
See Also
Reference
cOptions Interface
ETABSv1 Namespace